CREATE TABLE HOTLINE_COUNTRY(
    REG_ID varchar(255),
    COUNTRY_ID varchar(255)
);

INSERT INTO HOTLINE_COUNTRY (REG_ID,COUNTRY_ID)
VALUES 
('121763','เกาหลีใต้'),
('121763','สหรัฐอเมริกา'),
('121764','เกาหลีใต้'),
('121764','สหรัฐอเมริกา'),
('121816','นครรัฐวาติกัน'),
('121816','เยอรมนี'),
('121816','สาธารณรัฐเช็ก'),
('121816','อิตาลี'),
('122659','เยอรมนี'),
('122659','ไอซ์แลนด์'),
('103035','อิตาลี'),
('103035','ฝรั่งเศส'),
('103035','สวิตเซอร์แลนด์'),
('120968','มาเลเซีย'),
('120968','เนเธอร์แลนด์'),
('120968','อาร์เจนตินา'),
('120968','ชิลี'),
('120968','โบลิเวีย'),
('120968','เปรู'),
('120968','เม็กซิโก'),
('120968','คิวบา'),
('121591','สหรัฐอเมริกา'),
('121591','สหรัฐอาหรับเอมิเรตส์'),
('122671','เนเธอร์แลนด์'),
('122671','เบลเยียม'),
('122671','ฝรั่งเศส'),
('122671','เยอรมนี'),
('122622','เนเธอร์แลนด์'),
('122622','เบลเยียม'),
('122622','ฝรั่งเศส'),
('122622','เยอรมนี'),
('122622','ลักเซมเบิร์ก'),
('122622','สวิตเซอร์แลนด์'),
('122622','ออสเตรีย');

SELECT REG_ID,group_concat ((COUNTRY_ID ,';') as string_aggregate
FROM HOTLINE_COUNTRY
GROUP BY REG_ID
ORDER by group_concat (COUNTRY_ID ,';') ASC;

SELECT REG_ID,group_concat(COUNTRY_ID,';')
WITHIN GROUP (ORDER BY HOTLINE_COUNTRY_ID ASC) as string_aggregate
group_concat(li.percentage ORDER BY li.views ASC)
FROM HOTLINE_COUNTRY